app/helpers/posts_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def post_owner(user_id)
    @user= User.find_by(id:user_id).name