app/helpers/sessions_helper.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
       user ||=  User.find_by(id: cookies.signed[:user_id])