app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "testing"], ["body", "12345"], ["user_id", 8], ["created_at", "2019-07-04 16:29:21.592944"], ["updated_at", "2019-07-04 16:29:21.592944"]]
---
  def create
      @post = Post.new(post_params)
      @post.user_id = current_user.id
      @post.save