app/controllers/sessions_controller.rb

  def create
     user = User.find_by(email: params[:sessions][:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "i@g.com"], ["LIMIT", 1]]