app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("password_digest", "email", "name", "created_at", "updated_at", "remember_digest") VALUES (?, ?, ?, ?, ?, ?)